vertical-pod-autoscaler/experiments/sn-pbr-throughput/8minus/compose.log
Running 15m test @ http://10.104.17.238:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 25.831ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 17.030ms, rate sampling interval: 39ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   594.73ms  534.50ms   2.47s    77.32%
    Req/Sec     4.91     10.61    42.00     80.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  449.02ms
 75.000%  833.53ms
 90.000%    1.31s 
 99.000%    2.47s 
 99.900%    3.66s 
 99.990%    4.42s 
 99.999%    4.53s 
100.000%    4.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.095     0.000000            1         1.00
      71.615     0.100000          884         1.11
     157.311     0.200000         1771         1.25
     247.935     0.300000         2652         1.43
     341.247     0.400000         3537         1.67
     449.023     0.500000         4420         2.00
     508.927     0.550000         4860         2.22
     577.535     0.600000         5304         2.50
     653.311     0.650000         5745         2.86
     746.495     0.700000         6187         3.33
     833.535     0.750000         6628         4.00
     890.367     0.775000         6848         4.44
     946.687     0.800000         7070         5.00
    1011.711     0.825000         7290         5.71
    1094.655     0.850000         7517         6.67
    1191.935     0.875000         7735         8.00
    1239.039     0.887500         7843         8.89
    1307.647     0.900000         7954        10.00
    1368.063     0.912500         8063        11.43
    1435.647     0.925000         8175        13.33
    1520.639     0.937500         8284        16.00
    1587.199     0.943750         8339        17.78
    1649.663     0.950000         8395        20.00
    1704.959     0.956250         8451        22.86
    1773.567     0.962500         8505        26.67
    1857.535     0.968750         8560        32.00
    1919.999     0.971875         8589        35.56
    1974.271     0.975000         8617        40.00
    2057.215     0.978125         8643        45.71
    2154.495     0.981250         8671        53.33
    2232.319     0.984375         8698        64.00
    2279.423     0.985938         8712        71.11
    2334.719     0.987500         8726        80.00
    2430.975     0.989062         8740        91.43
    2488.319     0.990625         8754       106.67
    2584.575     0.992188         8767       128.00
    2613.247     0.992969         8774       142.22
    2676.735     0.993750         8781       160.00
    2752.511     0.994531         8788       182.86
    2836.479     0.995313         8796       213.33
    2885.631     0.996094         8802       256.00
    2922.495     0.996484         8805       284.44
    2990.079     0.996875         8809       320.00
    3043.327     0.997266         8812       365.71
    3080.191     0.997656         8816       426.67
    3153.919     0.998047         8819       512.00
    3301.375     0.998242         8821       568.89
    3385.343     0.998437         8823       640.00
    3448.831     0.998633         8824       731.43
    3518.463     0.998828         8826       853.33
    3688.447     0.999023         8828      1024.00
    3788.799     0.999121         8829      1137.78
    3934.207     0.999219         8830      1280.00
    3934.207     0.999316         8830      1462.86
    4003.839     0.999414         8831      1706.67
    4018.175     0.999512         8832      2048.00
    4079.615     0.999561         8833      2275.56
    4079.615     0.999609         8833      2560.00
    4079.615     0.999658         8833      2925.71
    4198.399     0.999707         8834      3413.33
    4198.399     0.999756         8834      4096.00
    4415.487     0.999780         8835      4551.11
    4415.487     0.999805         8835      5120.00
    4415.487     0.999829         8835      5851.43
    4415.487     0.999854         8835      6826.67
    4415.487     0.999878         8835      8192.00
    4530.175     0.999890         8836      9102.22
    4530.175     1.000000         8836          inf
#[Mean    =      594.727, StdDeviation   =      534.503]
#[Max     =     4526.080, Total count    =         8836]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8953 requests in 15.00m, 1.84MB read
  Socket errors: connect 0, read 0, write 7, timeout 16
Requests/sec:      9.95
Transfer/sec:      2.09KB